{
  "about-myself": {
    "title": "О себе",
    "name": "Шеин Максим Андреевич",
    "position": "Fullstack Developer",
    "description": "Разработчик с опытом создания надёжных и масштабируемых веб-приложений. Имею опыт разработки в микросервисной и монолитной архитектурах; участвовал в проектировании и развитии ключевых сервисов. Работаю в интенсивном ритме, оперативно подстраиваясь под потребности бизнеса. В свободное время разрабатываю ботов и прокачиваю свой стек."
  },
  "education": {
    "title": "Образование",
    "university": "Национальный исследовательский университет ИТМО, Санкт-Петербург",
    "faculty": "Информационные системы и технологии, Бакалавр"
  },
  "experience": {
    "title": "Опыт работы",

    "labels": {
      "about-company": "О компании:",
      "contribution": "Вклад:",
      "tech-stack": "Стек технологий:",
      "team": "Состав команды:",
      "till-now": "НВ"
    },

    "oxygen": {
      "name": "Oxygen Cloud Platform",
      "position": "Fullstack-разработчик",
      "description": "Разработка и развитие клиентского и внутреннего порталов для управления облачной инфраструктурой.",
      "company-description": "OXYGEN — облачная платформа и оператор дата-центров, входящий в топ-5 по России и предоставляющий масштабируемые облачные и инфраструктурные решения.",
      "contribution": [
        "Помог в запуске MVP и расширении продукта, что стало частью перехода компании от чистой B2B-модели к смешанной B2B+B2C. Это обеспечило поток новых клиентов и повысило удобство работы для текущей клиентской базы.",
        "Спроектировал и внедрил систему уведомлений и обращений для клиентского портала, что улучшило качество взаимодействия с пользователями.",
        "Реализовал адаптивные интерфейсы для клиентского и внутреннего порталов в рамках редизайна.",
        "Участвовал в разработке калькуляторов облачных ресурсов.",
        [
          "хранение и выдача файлов (MinIO)",
          "генерация документов по шаблонам (коммерческие предложения, счета)",
          "рассылка (email, SMS, Telegram)",
          "интеграция с 1С для синхронизации контрактов и счетов",
          "интеграция калькуляторов главного веб-сайта с внутренней экосистемой",
          "мониторинг и оповещения о статусах микросервисов"
        ],
        "Выполнил более 400 задач (фичи и баг фиксы); Cделал более 1000 коммитов в продакшн."
      ],
      "stack": "JavaScript, TypeScript, Docker\nBackend: NestJS, Hono, Prisma, PostgreSQL, MinIO, grammY\nFrontend: React, React Hook Form, Zod, SWR, Linaria",
      "team": "Project Manager, Backend-разработчики (2), Fullstack-разработчики (2), Frontend-разработчик (1), Веб-дизайнер (1), Тестировщик (1)"
    },

    "gazprom": {
      "name": "ООО «Газпромнефть - ЦР»",
      "position": "Производственная практика, Backend-разработчик",
      "description": "Разработка и поддержка REST API корпоративного веб-приложения",
      "stack": "Backend: Python, FastAPI, SQLAlchemy, Alembic, PostgreSQL"
    }
  },
  "soft-skills": {
    "title": "Soft Skills",
    "items": [
      {
        "label": "Коммуникабельность",
        "description": "Умею эффективно взаимодействовать с командой: поддерживаю прозрачность в задачах, понимаю зоны ответственности каждого и открыто делюсь контекстом. Легко обращаюсь за помощью и сам всегда готов подключиться, созвониться, провести мини-обсуждение и вместе найти решение. Такой подход ускоряет процессы, повышает качество решений и помогает избежать ошибок благодаря свежему взгляду со стороны."
      },
      {
        "label": "Способность к обучению",
        "description": "Tехнологии развиваются стремительно, поэтому я постоянно изучаю новые инструменты, подходы и практики. Быстро адаптируюсь к изменениям, осваиваю необходимые технологии и применяю их на практике, чтобы повышать эффективность разработки."
      },
      {
        "label": "Креативность",
        "description": "В работе нередко сталкивался с ситуациями, когда дизайн или макеты ещё не были полностью готовы. В таких случаях самостоятельно создавал временные решения, визуально и смыслово соответствующие общей стилистике продукта. Это позволяло команде не останавливаться на промежуточных этапах и продолжать разработку без потери темпа."
      },
      {
        "label": "Гибкость",
        "description": "Работал в командах с высокоинициативными коллегами, где важно быстро реагировать на изменения и поддерживать темп разработки, особенно при приближении дедлайнов. При необходимости могу подключиться к обсуждению или созвону в любое время и из любой точки - это помогает не задерживать процесс и сохранять стабильный прогресс команды."
      }
    ]
  }
}
