{
  "about-myself": {
    "title": "О себе",
    "name": "Шеин Максим Андреевич",
    "position": "Fullstack Developer",
    "description": "Разработчик с опытом создания надёжных и масштабируемых веб-приложений. Работал как с микросервисной, так и с монолитной архитектурами, участвовал в проектировании и развитии ключевых сервисов. Умею работать в высоком темпе и быстро подстраиваться под задачи бизнеса. В свободное время пишу ботов и развиваю свой стек."
  },
  "education": {
    "title": "Образование",
    "university": "Национальный исследовательский университет ИТМО, Санкт-Петербург",
    "faculty": "Информационные системы и технологии, Бакалавр"
  },
  "experience": {
    "title": "Опыт работы",

    "labels": {
      "about-company": "О компании:",
      "contribution": "Вклад:",
      "tech-stack": "Стек технологий:",
      "team": "Состав команды:",
      "till-now": "НВ"
    },

    "oxygen": {
      "name": "Oxygen Cloud Platform",
      "position": "Fullstack-разработчик",
      "description": "Разработка и развитие клиентского и внутреннего порталов для управления облачной инфраструктурой.",
      "company-description": "OXYGEN - облачная платформа и оператор дата-центров, входящий в топ-5 по России и предоставляющий масштабируемые облачные и инфраструктурные решения.",
      "contribution": [
        "Помог в запуске MVP и расширении продукта, что стало частью перехода компании от чистой B2B-модели к смешанной B2B+B2C. Это обеспечило поток новых клиентов и повысило удобство работы для текущей клиентской базы.",
        "Спроектировал и внедрил систему уведомлений и обращений для клиентского портала, что улучшило качество взаимодействия с пользователями.",
        "Реализовал адаптивные интерфейсы для клиентского и внутреннего порталов в рамках редизайна.",
        "Участвовал в разработке калькуляторов облачных ресурсов.",
        [
          "хранение и выдача файлов (MinIO)",
          "генерация документов по шаблонам (коммерческие предложения, счета)",
          "рассылка (email, SMS, Telegram)",
          "интеграция с 1С для синхронизации контрактов и счетов",
          "интеграция калькуляторов главного веб-сайта с внутренней экосистемой",
          "мониторинг и оповещения о статусах микросервисов"
        ],
        "Выполнил более 400 задач (фичи и баг фиксы); Cделал более 1000 коммитов в продакшн."
      ],
      "stack": "JavaScript, TypeScript, Docker\nBackend: NestJS, Hono, Prisma, PostgreSQL, MinIO, grammY\nFrontend: React, React Hook Form, Zod, SWR, Linaria",
      "team": "Project Manager, Backend-разработчики (2), Fullstack-разработчики (2), Frontend-разработчик (1), Веб-дизайнер (1), Тестировщик (1)"
    },

    "gazprom": {
      "name": "ООО «Газпромнефть - ЦР»",
      "position": "Производственная практика, Backend-разработчик",
      "description": "Разработка и поддержка REST API корпоративного веб-приложения",
      "company-description": "Газпром ЦР - технологическая платформа и интегратор цифровых решений, специализирующийся на разработке, внедрении и сопровождении ИТ-систем для корпоративных и промышленных клиентов.",
      "stack": "Backend: Python, FastAPI, SQLAlchemy, Alembic, PostgreSQL"
    }
  },
  "soft-skills": {
    "title": "Soft Skills",
    "items": [
      {
        "label": "Коммуникабельность",
        "description": "Умею эффективно взаимодействовать с командой: поддерживаю прозрачность в рабочих процессах, понимаю зоны ответственности каждого участника и открыто делюсь контекстом. Всегда готов помочь коллегам - созвониться, обсудить задачу, предложить варианты решений и вместе найти оптимальный подход. Такой стиль работы ускоряет процессы, повышает качество итогового результата и помогает избежать ошибок благодаря свежему взгляду со стороны."
      },
      {
        "label": "Способность к обучению",
        "description": "IT развивается стремительно, поэтому я регулярно изучаю новые технологии. Быстро ориентируюсь в новых условиях, осваиваю нужные подходы и применяю их в реальных задачах, чтобы повысить эффективность своей работы."
      },
      {
        "label": "Креативность",
        "description": "Нередко сталкивался с ситуациями, когда макеты ещё не были готовы полностью. В таких случаях согласовывал и создавал временные решения, визуально и содержательно соответствующие стилистике продукта. Это позволяло команде не останавливаться на промежуточных этапах и продолжать разработку без потери темпа."
      },
      {
        "label": "Гибкость",
        "description": "Работал в командах с инициативными коллегами, где важно быстро реагировать на новые вводные и поддерживать высокий ритм, особенно при приближении дедлайнов. При необходимости могу подключиться к обсуждению или звонку в любое время и из любой точки."
      }
    ]
  }
}
